### Below is the Plan

Terraform will perform the following actions:

  # module.aws.aws_s3_bucket.chat will be updated in-place
  ~ resource "aws_s3_bucket" "chat" {
      + force_destroy               = false
        id                          = "tl-public-chat-et-stg"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket.docs will be updated in-place
  ~ resource "aws_s3_bucket" "docs" {
      + force_destroy               = false
        id                          = "tl-aselo-docs-et-staging"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket_cors_configuration.chat will be created
  + resource "aws_s3_bucket_cors_configuration" "chat" {
      + bucket = "tl-public-chat-et-stg"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_cors_configuration.docs will be created
  + resource "aws_s3_bucket_cors_configuration" "docs" {
      + bucket = "tl-aselo-docs-et-staging"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_lifecycle_configuration.hrm_export_expiry will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "hrm_export_expiry" {
      + bucket = "tl-aselo-docs-et-staging"
      + id     = (known after apply)

      + rule {
          + id     = "HRM Exported Data Expiration Policy"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "hrm-data/"
            }
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-et-stg"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-et-staging"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_public_access_block.chat will be created
  + resource "aws_s3_bucket_public_access_block" "chat" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "tl-public-chat-et-stg"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.aws.aws_s3_bucket_public_access_block.docs will be created
  + resource "aws_s3_bucket_public_access_block" "docs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tl-aselo-docs-et-staging"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.chat will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "chat" {
      + bucket = "tl-public-chat-et-stg"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.docs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "docs" {
      + bucket = "tl-aselo-docs-et-staging"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/aws/ACfd932bd76669f9cc2145e67e6c3e03ea/region"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/ACfd932bd76669f9cc2145e67e6c3e03ea/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/ACfd932bd76669f9cc2145e67e6c3e03ea/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_access_token will be created
  + resource "aws_ssm_parameter" "datadog_access_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Access Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/access_token"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/access_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/access_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_app_id will be created
  + resource "aws_ssm_parameter" "datadog_app_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Application ID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/app_id"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/app_id"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/ACfd932bd76669f9cc2145e67e6c3e03ea/app_id"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["ACCESS_TOKEN"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = (sensitive value)
        id          = "STG_DATADOG_ET_ACCESS_TOKEN"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["APP_ID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = (sensitive value)
        id          = "STG_DATADOG_ET_APP_ID"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Ethiopia Twilio account – Chat service SID " -> "Twilio account - Chat service SID"
        id          = "STG_TWILIO_ET_CHAT_SERVICE_SID"
        name        = "STG_TWILIO_ET_CHAT_SERVICE_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/STG_TWILIO_ET_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Staging - Ethiopia Twilio account - Chat transfer workflow SID " -> (known after apply)
      ~ id             = "STG_TWILIO_ET_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "STG_TWILIO_ET_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> null
      ~ tags_all       = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["FLEX_PROXY_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Flex Proxy service SID"
        id          = "STG_TWILIO_ET_FLEX_PROXY_SERVICE_SID"
        name        = "STG_TWILIO_ET_FLEX_PROXY_SERVICE_SID"
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["OPERATING_INFO_KEY"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Operating Key info"
        id          = "STG_TWILIO_ET_OPERATING_INFO_KEY"
        name        = "STG_TWILIO_ET_OPERATING_INFO_KEY"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["S3_BUCKET_DOCS"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - XXXXXXXXXXXXXXXXXX Twilio account - S3 Bucket for storing documents" -> "Twilio account - Post Survey bot chat url"
        id          = "STG_TWILIO_ET_S3_BUCKET_DOCS"
        name        = "STG_TWILIO_ET_S3_BUCKET_DOCS"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/STG_TWILIO_ET_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      + description    = (known after apply)
      ~ id             = "STG_TWILIO_ET_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "STG_TWILIO_ET_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SYNC_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Ethiopia Twilio account – Sync service SID " -> "Twilio account - Sync service "
        id          = "STG_TWILIO_ET_SYNC_SID"
        name        = "STG_TWILIO_ET_SYNC_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["WORKSPACE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Ethiopia Twilio account - Workspace SID " -> "Twilio account - Workspace SID"
        id          = "STG_TWILIO_ET_WORKSPACE_SID"
        name        = "STG_TWILIO_ET_WORKSPACE_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Ethiopia" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Ethiopia"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.s3_docs_bucket_id will be updated in-place
  ~ resource "aws_ssm_parameter" "s3_docs_bucket_id" {
      + description = "S3 - Docs bucket name"
        id          = "/staging/s3/ACfd932bd76669f9cc2145e67e6c3e03ea/docs_bucket_name"
        name        = "/staging/s3/ACfd932bd76669f9cc2145e67e6c3e03ea/docs_bucket_name"
      ~ tags        = {
          + "Environment" = "staging"
          + "Name"        = "/staging/s3/ACfd932bd76669f9cc2145e67e6c3e03ea/docs_bucket_name"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "staging"
          + "Name"        = "/staging/s3/ACfd932bd76669f9cc2145e67e6c3e03ea/docs_bucket_name"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.serverless_base_url will be updated in-place
  ~ resource "aws_ssm_parameter" "serverless_base_url" {
      + description    = "Serverless - Base URL"
        id             = "/staging/serverless/ACfd932bd76669f9cc2145e67e6c3e03ea/base_url"
      + insecure_value = (known after apply)
        name           = "/staging/serverless/ACfd932bd76669f9cc2145e67e6c3e03ea/base_url"
      ~ tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/serverless/ACfd932bd76669f9cc2145e67e6c3e03ea/base_url"
          + "Terraform"   = "true"
        }
      ~ tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/serverless/ACfd932bd76669f9cc2145e67e6c3e03ea/base_url"
          + "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_auth_token will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_auth_token" {
      + description = "Twilio account - Auth Token"
        id          = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/auth_token"
        name        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/auth_token"
      ~ tags        = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/auth_token"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/auth_token"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_service_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_workflow_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_flex_proxy_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_flex_proxy_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Flex Proxy service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/flex_proxy_service_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_operating_info_key will be created
  + resource "aws_ssm_parameter" "twilio_operating_info_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Operating Info Key"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/operating_info_key"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/operating_info_key"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/operating_info_key"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_short_helpline_to_account_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_short_helpline_to_account_sid" {
      + description = "Twilio account - account SID by short helpline"
        id          = "/staging/twilio/ET/account_sid"
        name        = "/staging/twilio/ET/account_sid"
      ~ tags        = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ET/account_sid"
          + "Terraform"   = "true"
        }
      ~ tags_all    = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ET/account_sid"
          + "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Survey Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/survey_workflow_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_sync_sid will be created
  + resource "aws_ssm_parameter" "twilio_sync_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Sync service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/sync_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/sync_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/sync_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_workspace_sid will be created
  + resource "aws_ssm_parameter" "twilio_workspace_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Workspace SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/workspace_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/workspace_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/ACfd932bd76669f9cc2145e67e6c3e03ea/workspace_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_account_sid will be created
  + resource "github_actions_secret" "flex_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "ET_STG_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_auth_token will be created
  + resource "github_actions_secret" "flex_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "ET_STG_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_account_sid will be created
  + resource "github_actions_secret" "serverless_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "ET_STG_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_auth_token will be created
  + resource "github_actions_secret" "serverless_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "ET_STG_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.webchat_serverless_url will be created
  + resource "github_actions_secret" "webchat_serverless_url" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "webchat"
      + secret_name     = "ET_STG_SERVERLESS_URL"
      + updated_at      = (known after apply)
    }

  # module.hrmServiceIntegration.null_resource.hrm_static_api_key will be created
  + resource "null_resource" "hrm_static_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Staging"
          + "helpline"          = "Adama Child Helpline"
          + "short_environment" = "STG"
          + "short_helpline"    = "ET"
        }
    }

  # module.serverless.data.external.service_environment_production will be read during apply
  # (config refers to values not yet known)
 <= data "external" "service_environment_production" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "../../serverless/default/getServerlessServiceEnvironmentData.py",
        ]
      + query   = {
          + "environment_sid"    = (known after apply)
          + "service_sid"        = "ZS3d6dc8ab3c15e8332ecab26e71550a04"
          + "twilio_account_sid" = (sensitive value)
          + "twilio_auth_token"  = (sensitive value)
        }
      + result  = (known after apply)
    }

  # module.serverless.twilio_serverless_services_environments_v1.dev must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "dev" {
      ~ id            = "ZS3d6dc8ab3c15e8332ecab26e71550a04/ZEbdb6f415924758e494eb81cd546701ce" -> (known after apply)
      ~ sid           = "ZEbdb6f415924758e494eb81cd546701ce" -> (known after apply)
      ~ unique_name   = "dev-environment" -> "dev" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.serverless.twilio_serverless_services_environments_v1.production must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "production" {
      ~ id            = "ZS3d6dc8ab3c15e8332ecab26e71550a04/ZE249d4253ce498997a7b843de4752f8a4" -> (known after apply)
      ~ sid           = "ZE249d4253ce498997a7b843de4752f8a4" -> (known after apply)
      ~ unique_name   = "production-environment" -> "production" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.services.null_resource.sync_api_key will be created
  + resource "null_resource" "sync_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Staging"
          + "helpline"          = "Adama Child Helpline"
          + "short_environment" = "STG"
          + "short_helpline"    = "ET"
        }
    }

  # module.services.twilio_chat_services_v2.flex_chat_service will be updated in-place
  ~ resource "twilio_chat_services_v2" "flex_chat_service" {
      ~ friendly_name                              = "Flex Chat Service" -> "Flex Conversation Service"
        id                                         = "IS85c1f3369a7d48a98d4d5dcd1c6e0f39"
        # (21 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSfdb3a599feafd305b652c9652dc22c26"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ event_callback_url     = "https://serverless-5820-production.twil.io/webhooks/taskrouterCallback" -> (known after apply)
      ~ events_filter          = "task.created,task.completed,task.canceled,task.deleted,task.system-deleted,task.wrapup,reservation.accepted,reservation.rejected,reservation.timeout,reservation.wrapup,task-queue.entered" -> "task.created,task.canceled,task.completed,task.deleted,task.wrapup,task-queue.entered,task.system-deleted,reservation.accepted,reservation.rejected,reservation.timeout,reservation.wrapup"
        id                     = "WSfdb3a599feafd305b652c9652dc22c26"
        # (6 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "isContactlessTask==true"
                          - filter_friendly_name = "Offline Contacts"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\" AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ8bbfed8687ff92018598d64c7c51a8d4"
                                },
                            ]
                        },
                      - {
                          - expression           = "helpline==\"Adama Child Helpline\" OR twilioNumber==\"messenger:110628727963549\" OR channelType == \"web\""
                          - filter_friendly_name = "Adama Child Helpline"
                          - targets              = [
                              - {
                                  - expression = "(((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == \"worker\" AND task.targetSid == worker.sid) OR (task.transferTargetType != \"worker\"AND worker.sid != task.ignoreAgent))AND worker.waitingOfflineContact != true)"
                                  - queue      = "WQ8bbfed8687ff92018598d64c7c51a8d4"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WSfdb3a599feafd305b652c9652dc22c26/WWebe766ad95020b831475e456cd8fa419"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          + filter_friendly_name = "CaptureChannel"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WSfdb3a599feafd305b652c9652dc22c26/WW6cbbe5a2e54c41578e7f15d88bbab5aa"
        # (3 unchanged attributes hidden)
    }

Plan: 31 to add, 18 to change, 4 to destroy.

Changes to Outputs:
  ~ serverless_environment_production_sid = "ZE249d4253ce498997a7b843de4752f8a4" -> (known after apply)
  ~ serverless_url                        = "https://serverless-5820-production.twil.io" -> (known after apply)
  ~ task_router_master_workflow_sid       = "WWebe766ad95020b831475e456cd8fa419" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master = "WWebe766ad95020b831475e456cd8fa419" -> (known after apply)
      ~ survey = "WW6cbbe5a2e54c41578e7f15d88bbab5aa" -> (known after apply)
    }
